[NoCoverage] BlockStatement
src/App.tsx:4:29
 import React from 'react';
 import SearchEngine from './components/SearchEngine';
 
-const App: React.FC = () => {
-  return (
-    <div className="min-h-screen bg-gray-100 py-8">
-      <div className="container mx-auto px-4">
-        <SearchEngine />
-      </div>
-    </div>
-  );
-};
+const App: React.FC = () => {};
 
 export default App; 
