[Survived] StringLiteral
src/components/SearchEngine.tsx:6:45
 const data = [
     { id: 1, title: "Apple Pie Recipe", content: "A delicious apple pie with a flaky crust." },
     { id: 2, title: "Banana Bread", content: "Moist banana bread with walnuts." },
-    { id: 3, title: "Cherry Tart", content: "Sweet and tangy cherry tart." },
+    { id: 3, title: "Cherry Tart", content: "" },
     { id: 4, title: "Apple Smoothie", content: "Refreshing apple and yogurt smoothie." },
     { id: 5, title: "Orange Cake", content: "Zesty orange-flavored cake." },

[Survived] StringLiteral
src/components/SearchEngine.tsx:7:48
     { id: 1, title: "Apple Pie Recipe", content: "A delicious apple pie with a flaky crust." },
     { id: 2, title: "Banana Bread", content: "Moist banana bread with walnuts." },
     { id: 3, title: "Cherry Tart", content: "Sweet and tangy cherry tart." },
-    { id: 4, title: "Apple Smoothie", content: "Refreshing apple and yogurt smoothie." },
+    { id: 4, title: "Apple Smoothie", content: "" },
     { id: 5, title: "Orange Cake", content: "Zesty orange-flavored cake." },
     { id: 6, title: "Blueberry Muffin", content: "Soft muffins with fresh blueberries." },

[Survived] StringLiteral
src/components/SearchEngine.tsx:8:21
     { id: 2, title: "Banana Bread", content: "Moist banana bread with walnuts." },
     { id: 3, title: "Cherry Tart", content: "Sweet and tangy cherry tart." },
     { id: 4, title: "Apple Smoothie", content: "Refreshing apple and yogurt smoothie." },
-    { id: 5, title: "Orange Cake", content: "Zesty orange-flavored cake." },
+    { id: 5, title: "", content: "Zesty orange-flavored cake." },
     { id: 6, title: "Blueberry Muffin", content: "Soft muffins with fresh blueberries." },
     { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },

[Survived] StringLiteral
src/components/SearchEngine.tsx:8:45
     { id: 2, title: "Banana Bread", content: "Moist banana bread with walnuts." },
     { id: 3, title: "Cherry Tart", content: "Sweet and tangy cherry tart." },
     { id: 4, title: "Apple Smoothie", content: "Refreshing apple and yogurt smoothie." },
-    { id: 5, title: "Orange Cake", content: "Zesty orange-flavored cake." },
+    { id: 5, title: "Orange Cake", content: "" },
     { id: 6, title: "Blueberry Muffin", content: "Soft muffins with fresh blueberries." },
     { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },

[Killed] ObjectLiteral
src/components/SearchEngine.tsx:10:5
     { id: 4, title: "Apple Smoothie", content: "Refreshing apple and yogurt smoothie." },
     { id: 5, title: "Orange Cake", content: "Zesty orange-flavored cake." },
     { id: 6, title: "Blueberry Muffin", content: "Soft muffins with fresh blueberries." },
-    { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },
+    {},
     { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
     { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },
killedBy: SearchEngine Component displays results for valid query
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] StringLiteral
src/components/SearchEngine.tsx:10:47
     { id: 4, title: "Apple Smoothie", content: "Refreshing apple and yogurt smoothie." },
     { id: 5, title: "Orange Cake", content: "Zesty orange-flavored cake." },
     { id: 6, title: "Blueberry Muffin", content: "Soft muffins with fresh blueberries." },
-    { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },
+    { id: 7, title: "Apple Crumble", content: "" },
     { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
     { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },

[Survived] StringLiteral
src/components/SearchEngine.tsx:11:21
     { id: 5, title: "Orange Cake", content: "Zesty orange-flavored cake." },
     { id: 6, title: "Blueberry Muffin", content: "Soft muffins with fresh blueberries." },
     { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },
-    { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
+    { id: 8, title: "", content: "Creamy lemon pie with meringue." },
     { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },
     { id: 10, title: "Mango Sorbet", content: "Cool and tropical mango sorbet." },

[Survived] StringLiteral
src/components/SearchEngine.tsx:12:21
     { id: 6, title: "Blueberry Muffin", content: "Soft muffins with fresh blueberries." },
     { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },
     { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
-    { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },
+    { id: 9, title: "", content: "Homemade strawberry jam." },
     { id: 10, title: "Mango Sorbet", content: "Cool and tropical mango sorbet." },
     { id: 11, title: "Tiramisu Classic", content: "Italian Tiramisu with espresso and mascarpone." }

[Killed] ObjectLiteral
src/components/SearchEngine.tsx:13:5
     { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },
     { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
     { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },
-    { id: 10, title: "Mango Sorbet", content: "Cool and tropical mango sorbet." },
+    {},
     { id: 11, title: "Tiramisu Classic", content: "Italian Tiramisu with espresso and mascarpone." }
 ]
killedBy: SearchEngine Component displays results for valid query
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] StringLiteral
src/components/SearchEngine.tsx:13:22
     { id: 7, title: "Apple Crumble", content: "Warm apple crumble with oats." },
     { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
     { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },
-    { id: 10, title: "Mango Sorbet", content: "Cool and tropical mango sorbet." },
+    { id: 10, title: "", content: "Cool and tropical mango sorbet." },
     { id: 11, title: "Tiramisu Classic", content: "Italian Tiramisu with espresso and mascarpone." }
 ]

[Killed] ObjectLiteral
src/components/SearchEngine.tsx:14:5
     { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
     { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },
     { id: 10, title: "Mango Sorbet", content: "Cool and tropical mango sorbet." },
-    { id: 11, title: "Tiramisu Classic", content: "Italian Tiramisu with espresso and mascarpone." }
+    {}
 ]
 
killedBy: SearchEngine Component displays results for valid query
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] StringLiteral
src/components/SearchEngine.tsx:14:22
     { id: 8, title: "Lemon Pie", content: "Creamy lemon pie with meringue." },
     { id: 9, title: "Strawberry Jam", content: "Homemade strawberry jam." },
     { id: 10, title: "Mango Sorbet", content: "Cool and tropical mango sorbet." },
-    { id: 11, title: "Tiramisu Classic", content: "Italian Tiramisu with espresso and mascarpone." }
+    { id: 11, title: "", content: "Italian Tiramisu with espresso and mascarpone." }
 ]
 
killedBy: SearchEngine Component handles case-sensitive search with content match
statusReason: TestingLibraryElementError: Unable to find an element with the text: Tiramisu Classic. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] BooleanLiteral
src/components/SearchEngine.tsx:25:58
 
 const SearchEngine = () => {
    const [query, setQuery] = useState('')
-  const [isCaseSensitive, setIsCaseSensitive] = useState(false)
+  const [isCaseSensitive, setIsCaseSensitive] = useState(true)
   const [results, setResults] = useState<SearchResult[]>([])
   const [currentPage, setCurrentPage] = useState(1)
killedBy: SearchEngine Component renders with initial state
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input checked="" class="mr-2" data-testid="case-sensitive-checkbox" type="checkbox" />

[Killed] ArrayDeclaration
src/components/SearchEngine.tsx:26:58
 const SearchEngine = () => {
    const [query, setQuery] = useState('')
   const [isCaseSensitive, setIsCaseSensitive] = useState(false)
-  const [results, setResults] = useState<SearchResult[]>([])
+  const [results, setResults] = useState<SearchResult[]>(["Stryker was here"])
   const [currentPage, setCurrentPage] = useState(1)
   const [error, setError] = useState('')
killedBy: SearchEngine Component renders with initial state
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <ul class="space-y-2" data-testid="results-list"><li class="p-2 border rounded-lg hover:bg-gray-50"><h3 class="font-semibold text-gray-900" /><p class="text-gray-600" /></li></ul> instead

[Survived] BooleanLiteral
src/components/SearchEngine.tsx:29:50
   const [results, setResults] = useState<SearchResult[]>([])
   const [currentPage, setCurrentPage] = useState(1)
   const [error, setError] = useState('')
-  const [hasSearched, setHasSearched] = useState(false)
+  const [hasSearched, setHasSearched] = useState(true)
   const resultsPerPage = 5
 

[Killed] BooleanLiteral
src/components/SearchEngine.tsx:33:20
   const resultsPerPage = 5
 
   const performSearch = (searchQuery: string) => {
-    setHasSearched(true)
+    setHasSearched(false)
     if (!searchQuery.trim()) {
       setError('Please enter a search query.')
killedBy: SearchEngine Component handles case-sensitive search with no results
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="no-results"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:34:9
 
   const performSearch = (searchQuery: string) => {
     setHasSearched(true)
-    if (!searchQuery.trim()) {
+    if (true) {
       setError('Please enter a search query.')
       setResults([])
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:34:9
 
   const performSearch = (searchQuery: string) => {
     setHasSearched(true)
-    if (!searchQuery.trim()) {
+    if (false) {
       setError('Please enter a search query.')
       setResults([])
killedBy: SearchEngine Component displays error for empty query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="error-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ArrayDeclaration
src/components/SearchEngine.tsx:36:18
     setHasSearched(true)
     if (!searchQuery.trim()) {
       setError('Please enter a search query.')
-      setResults([])
+      setResults(["Stryker was here"])
       return
     }
killedBy: SearchEngine Component displays error for empty query
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <ul class="space-y-2" data-testid="results-list"><li class="p-2 border rounded-lg hover:bg-gray-50"><h3 class="font-semibold text-gray-900" /><p class="text-gray-600" /></li></ul> instead

[Killed] BlockStatement
src/components/SearchEngine.tsx:40:35
       return
     }
 
-    if (searchQuery.length > 255) {
-      setError('Query is too long. Maximum 255 characters allowed.')
-      setResults([])
-      return
-    }
+    if (searchQuery.length > 255) {}
 
     setError('');
killedBy: SearchEngine Component handles 256 character query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="error-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] EqualityOperator
src/components/SearchEngine.tsx:40:9
       return
     }
 
-    if (searchQuery.length > 255) {
+    if (searchQuery.length <= 255) {
       setError('Query is too long. Maximum 255 characters allowed.')
       setResults([])
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] MethodExpression
src/components/SearchEngine.tsx:48:29
 
     setError('');
     
-    const filteredResults = data.filter(item => {
-      const searchText = isCaseSensitive ? searchQuery : searchQuery.toLowerCase()
-      const itemTitle = isCaseSensitive ? item.title : item.title.toLowerCase()
-      const itemContent = isCaseSensitive ? item.content : item.content.toLowerCase()
-      const matches = itemTitle.includes(searchText) || itemContent.includes(searchText)
-      return matches
-    })
+    const filteredResults = data
 
     setResults(filteredResults)
killedBy: SearchEngine Component displays results for valid query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 5

[Killed] BlockStatement
src/components/SearchEngine.tsx:48:49
 
     setError('');
     
-    const filteredResults = data.filter(item => {
-      const searchText = isCaseSensitive ? searchQuery : searchQuery.toLowerCase()
-      const itemTitle = isCaseSensitive ? item.title : item.title.toLowerCase()
-      const itemContent = isCaseSensitive ? item.content : item.content.toLowerCase()
-      const matches = itemTitle.includes(searchText) || itemContent.includes(searchText)
-      return matches
-    })
+    const filteredResults = data.filter(item => {})
 
     setResults(filteredResults)
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] MethodExpression
src/components/SearchEngine.tsx:49:58
     setError('');
     
     const filteredResults = data.filter(item => {
-      const searchText = isCaseSensitive ? searchQuery : searchQuery.toLowerCase()
+      const searchText = isCaseSensitive ? searchQuery : searchQuery.toUpperCase()
       const itemTitle = isCaseSensitive ? item.title : item.title.toLowerCase()
       const itemContent = isCaseSensitive ? item.content : item.content.toLowerCase()
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Survived] MethodExpression
src/components/SearchEngine.tsx:50:56
     
     const filteredResults = data.filter(item => {
       const searchText = isCaseSensitive ? searchQuery : searchQuery.toLowerCase()
-      const itemTitle = isCaseSensitive ? item.title : item.title.toLowerCase()
+      const itemTitle = isCaseSensitive ? item.title : item.title.toUpperCase()
       const itemContent = isCaseSensitive ? item.content : item.content.toLowerCase()
       const matches = itemTitle.includes(searchText) || itemContent.includes(searchText)

[Killed] MethodExpression
src/components/SearchEngine.tsx:51:60
     const filteredResults = data.filter(item => {
       const searchText = isCaseSensitive ? searchQuery : searchQuery.toLowerCase()
       const itemTitle = isCaseSensitive ? item.title : item.title.toLowerCase()
-      const itemContent = isCaseSensitive ? item.content : item.content.toLowerCase()
+      const itemContent = isCaseSensitive ? item.content : item.content.toUpperCase()
       const matches = itemTitle.includes(searchText) || itemContent.includes(searchText)
       return matches
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 3
Received:
  Page 1 of 2

[Killed] LogicalOperator
src/components/SearchEngine.tsx:52:23
       const searchText = isCaseSensitive ? searchQuery : searchQuery.toLowerCase()
       const itemTitle = isCaseSensitive ? item.title : item.title.toLowerCase()
       const itemContent = isCaseSensitive ? item.content : item.content.toLowerCase()
-      const matches = itemTitle.includes(searchText) || itemContent.includes(searchText)
+      const matches = itemTitle.includes(searchText) && itemContent.includes(searchText)
       return matches
     })
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 3
Received:
  Page 1 of 2

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:52:23
       const searchText = isCaseSensitive ? searchQuery : searchQuery.toLowerCase()
       const itemTitle = isCaseSensitive ? item.title : item.title.toLowerCase()
       const itemContent = isCaseSensitive ? item.content : item.content.toLowerCase()
-      const matches = itemTitle.includes(searchText) || itemContent.includes(searchText)
+      const matches = true
       return matches
     })
killedBy: SearchEngine Component displays results for valid query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 5

[Killed] BlockStatement
src/components/SearchEngine.tsx:60:68
     setCurrentPage(1)
   }
 
-  const handleSearch = (e: React.ChangeEvent<HTMLInputElement>) => {
-    const newQuery = e.target.value
-    setQuery(newQuery)
-    setHasSearched(false)
-    setResults([])
-    setError('')
-  }
+  const handleSearch = (e: React.ChangeEvent<HTMLInputElement>) => {}
 
   const handleKeyPress = (e: React.KeyboardEvent<HTMLInputElement>) => {
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] BooleanLiteral
src/components/SearchEngine.tsx:63:20
   const handleSearch = (e: React.ChangeEvent<HTMLInputElement>) => {
     const newQuery = e.target.value
     setQuery(newQuery)
-    setHasSearched(false)
+    setHasSearched(true)
     setResults([])
     setError('')
killedBy: SearchEngine Component resets results when typing new query
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-gray-500" data-testid="no-results">No results found for "banana"</p> instead

[Killed] BlockStatement
src/components/SearchEngine.tsx:68:72
     setError('')
   }
 
-  const handleKeyPress = (e: React.KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
-      performSearch(query)
-    }
-  }
+  const handleKeyPress = (e: React.KeyboardEvent<HTMLInputElement>) => {}
 
   const totalPages = Math.ceil(results.length / resultsPerPage);
killedBy: SearchEngine Component handles Enter key press
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] BlockStatement
src/components/SearchEngine.tsx:69:28
   }
 
   const handleKeyPress = (e: React.KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
-      performSearch(query)
-    }
+    if (e.key === 'Enter') {}
   }
 
killedBy: SearchEngine Component handles Enter key press
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] EqualityOperator
src/components/SearchEngine.tsx:69:9
   }
 
   const handleKeyPress = (e: React.KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
+    if (e.key !== 'Enter') {
       performSearch(query)
     }
killedBy: SearchEngine Component handles Enter key press
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="results-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ArithmeticOperator
src/components/SearchEngine.tsx:74:32
     }
   }
 
-  const totalPages = Math.ceil(results.length / resultsPerPage);
+  const totalPages = Math.ceil(results.length * resultsPerPage);
   const paginatedResults = results.slice(
     (currentPage - 1) * resultsPerPage,
killedBy: SearchEngine Component pagination for single page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span class="text-gray-600" data-testid="page-info">Page 1 of 15</span> instead

[Killed] MethodExpression
src/components/SearchEngine.tsx:75:28
   }
 
   const totalPages = Math.ceil(results.length / resultsPerPage);
-  const paginatedResults = results.slice(
-    (currentPage - 1) * resultsPerPage,
-    currentPage * resultsPerPage
-  );
+  const paginatedResults = results;
 
   const handlePageChange = (page: number) => {
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 11

[Killed] ArithmeticOperator
src/components/SearchEngine.tsx:76:6
 
   const totalPages = Math.ceil(results.length / resultsPerPage);
   const paginatedResults = results.slice(
-    (currentPage - 1) * resultsPerPage,
+    (currentPage + 1) * resultsPerPage,
     currentPage * resultsPerPage
   );
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "listitem"

Here are the accessible roles:

  heading:

  Name "Simple Search Engine":
  <h1

[Survived] ArithmeticOperator
src/components/SearchEngine.tsx:76:5
 
   const totalPages = Math.ceil(results.length / resultsPerPage);
   const paginatedResults = results.slice(
-    (currentPage - 1) * resultsPerPage,
+    (currentPage - 1) / resultsPerPage,
     currentPage * resultsPerPage
   );

[Killed] ArithmeticOperator
src/components/SearchEngine.tsx:77:5
   const totalPages = Math.ceil(results.length / resultsPerPage);
   const paginatedResults = results.slice(
     (currentPage - 1) * resultsPerPage,
-    currentPage * resultsPerPage
+    currentPage / resultsPerPage
   );
 
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "listitem"

Here are the accessible roles:

  heading:

  Name "Simple Search Engine":
  <h1

[Killed] BlockStatement
src/components/SearchEngine.tsx:80:46
     currentPage * resultsPerPage
   );
 
-  const handlePageChange = (page: number) => {
-    if (page >= 1 && page <= totalPages) {
-      setCurrentPage(page)
-    }
-  }
+  const handlePageChange = (page: number) => {}
 
   return (
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] BlockStatement
src/components/SearchEngine.tsx:81:42
   );
 
   const handlePageChange = (page: number) => {
-    if (page >= 1 && page <= totalPages) {
-      setCurrentPage(page)
-    }
+    if (page >= 1 && page <= totalPages) {}
   }
 
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:81:9
   );
 
   const handlePageChange = (page: number) => {
-    if (page >= 1 && page <= totalPages) {
+    if (false) {
       setCurrentPage(page)
     }
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] BlockStatement
src/components/SearchEngine.tsx:103:30
               data-testid="search-input"
             />
             <button
-              onClick={() => {performSearch(query)}}
+              onClick={() => {}}
               className="px-4 py-2 bg-blue-500 text-white rounded-lg hover:bg-blue-600"
               data-testid="search-button"
killedBy: SearchEngine Component displays error for empty query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="error-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] BooleanLiteral
src/components/SearchEngine.tsx:115:50
             <input
               type="checkbox"
               checked={isCaseSensitive}
-              onChange={() => setIsCaseSensitive(!isCaseSensitive)}
+              onChange={() => setIsCaseSensitive(isCaseSensitive)}
               className="mr-2"
               data-testid="case-sensitive-checkbox"
killedBy: SearchEngine Component handles case-sensitive search with no results
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="no-results"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ArrowFunction
src/components/SearchEngine.tsx:115:25
             <input
               type="checkbox"
               checked={isCaseSensitive}
-              onChange={() => setIsCaseSensitive(!isCaseSensitive)}
+              onChange={() => undefined}
               className="mr-2"
               data-testid="case-sensitive-checkbox"
killedBy: SearchEngine Component handles case-sensitive search with no results
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="no-results"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:122:12
             <label>Case Sensitive</label>
           </div>
 
-          {error && (
-            <p className="text-red-500" data-testid="error-message">{error}</p>
-          )}
+          {false}
 
           {results.length > 0 ? (
killedBy: SearchEngine Component displays error for empty query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="error-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:122:12
             <label>Case Sensitive</label>
           </div>
 
-          {error && (
-            <p className="text-red-500" data-testid="error-message">{error}</p>
-          )}
+          {true}
 
           {results.length > 0 ? (
killedBy: SearchEngine Component displays error for empty query
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="error-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] EqualityOperator
src/components/SearchEngine.tsx:126:12
             <p className="text-red-500" data-testid="error-message">{error}</p>
           )}
 
-          {results.length > 0 ? (
+          {results.length >= 0 ? (
             <div>
               <p className="mb-2 text-gray-700">Found {results.length} results</p>
killedBy: SearchEngine Component renders with initial state
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <ul class="space-y-2" data-testid="results-list" /> instead

[Killed] EqualityOperator
src/components/SearchEngine.tsx:126:12
             <p className="text-red-500" data-testid="error-message">{error}</p>
           )}
 
-          {results.length > 0 ? (
+          {results.length <= 0 ? (
             <div>
               <p className="mb-2 text-gray-700">Found {results.length} results</p>
killedBy: SearchEngine Component renders with initial state
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <ul class="space-y-2" data-testid="results-list" /> instead
