[Killed] ArrowFunction
src/components/SearchEngine.tsx:130:39
             <div>
               <p className="mb-2 text-gray-700">Found {results.length} results</p>
               <ul className="space-y-2" data-testid="results-list">
-                {paginatedResults.map(item => (
-                  <li key={item.id} className="p-2 border rounded-lg hover:bg-gray-50">
-                    <h3 className="font-semibold text-gray-900">{item.title}</h3>
-                    <p className="text-gray-600">{item.content}</p>
-                  </li>
-                ))}
+                {paginatedResults.map(() => undefined)}
               </ul>
 
killedBy: SearchEngine Component displays results for valid query
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "listitem"

Here are the accessible roles:

  heading:

  Name "Simple Search Engine":
  <h1

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:138:16
                 ))}
               </ul>
 
-              {totalPages > 1 && (
-                <div className="flex justify-between mt-4">
-                  <button
-                    onClick={() => handlePageChange(currentPage - 1)}
-                    disabled={currentPage === 1}
-                    className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
-                    data-testid="prev-page"
-                  >
-                    Previous
-                  </button>
-                  <span className="text-gray-600" data-testid="page-info">
-                    Page {currentPage} of {totalPages}
-                  </span>
-                  <button
-                    onClick={() => handlePageChange(currentPage + 1)}
-                    disabled={currentPage === totalPages}
-                    className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
-                    data-testid="next-page"
-                  >
-                    Next
-                  </button>
-                </div>
-              )}
+              {true}
             </div>
           ) : (
killedBy: SearchEngine Component pagination for multiple pages
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="page-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Survived] ArithmeticOperator
src/components/SearchEngine.tsx:141:53
               {totalPages > 1 && (
                 <div className="flex justify-between mt-4">
                   <button
-                    onClick={() => handlePageChange(currentPage - 1)}
+                    onClick={() => handlePageChange(currentPage + 1)}
                     disabled={currentPage === 1}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"

[Survived] ArrowFunction
src/components/SearchEngine.tsx:141:30
               {totalPages > 1 && (
                 <div className="flex justify-between mt-4">
                   <button
-                    onClick={() => handlePageChange(currentPage - 1)}
+                    onClick={() => undefined}
                     disabled={currentPage === 1}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:142:31
                 <div className="flex justify-between mt-4">
                   <button
                     onClick={() => handlePageChange(currentPage - 1)}
-                    disabled={currentPage === 1}
+                    disabled={true}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
                     data-testid="prev-page"
killedBy: SearchEngine Component handles pagination boundaries
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button class="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50" data-testid="prev-page" disabled="" />

[Killed] EqualityOperator
src/components/SearchEngine.tsx:142:31
                 <div className="flex justify-between mt-4">
                   <button
                     onClick={() => handlePageChange(currentPage - 1)}
-                    disabled={currentPage === 1}
+                    disabled={currentPage !== 1}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
                     data-testid="prev-page"
killedBy: SearchEngine Component handles pagination boundaries
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50" data-testid="prev-page" />

[Killed] ArrowFunction
src/components/SearchEngine.tsx:152:30
                     Page {currentPage} of {totalPages}
                   </span>
                   <button
-                    onClick={() => handlePageChange(currentPage + 1)}
+                    onClick={() => undefined}
                     disabled={currentPage === totalPages}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] ArithmeticOperator
src/components/SearchEngine.tsx:152:53
                     Page {currentPage} of {totalPages}
                   </span>
                   <button
-                    onClick={() => handlePageChange(currentPage + 1)}
+                    onClick={() => handlePageChange(currentPage - 1)}
                     disabled={currentPage === totalPages}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] EqualityOperator
src/components/SearchEngine.tsx:153:31
                   </span>
                   <button
                     onClick={() => handlePageChange(currentPage + 1)}
-                    disabled={currentPage === totalPages}
+                    disabled={currentPage !== totalPages}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
                     data-testid="next-page"
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:153:31
                   </span>
                   <button
                     onClick={() => handlePageChange(currentPage + 1)}
-                    disabled={currentPage === totalPages}
+                    disabled={true}
                     className="px-4 py-2 bg-gray-200 text-gray-700 rounded-lg hover:bg-gray-300 disabled:opacity-50"
                     data-testid="next-page"
killedBy: SearchEngine Component pagination for multiple pages
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] LogicalOperator
src/components/SearchEngine.tsx:163:13
               )}
             </div>
           ) : (
-            hasSearched && error === '' && query.trim() !== '' && (
+            hasSearched || error === '' && query.trim() !== '' && (
               <p className="text-gray-500" data-testid="no-results">
                 No results found for "{query}"
killedBy: SearchEngine Component resets results when typing new query
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-gray-500" data-testid="no-results">No results found for "banana"</p> instead

[Killed] ConditionalExpression
src/components/SearchEngine.tsx:163:13
               )}
             </div>
           ) : (
-            hasSearched && error === '' && query.trim() !== '' && (
-              <p className="text-gray-500" data-testid="no-results">
-                No results found for "{query}"
-              </p>
-            )
+            true
           )}
         </div>
killedBy: SearchEngine Component handles case-sensitive search with no results
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="no-results"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >
